# https://pypi.org/project/PyArabic/

import pyarabic.araby as araby

def isArabic(text):
    return araby.is_arabicstring(text)

specialArabic = {
    '٫', '٬', 'ٰ', 'ٱ', 'ٲ', 'ٳ', 'ٶ', 'ٹ', 'ٺ', 'پ', 'چ', 'ڈ', 'ډ', 'ڊ', 'ڒ', 'ڕ', 'ژ', 'ڛ', 'ڝ', 'ڤ', 'ڨ', 'ک', 'ڪ', 'ڭ', 'گ', 'ڱ', 'ڳ', 'ڴ',
    'ڵ', 'ں', 'ھ', 'ہ', 'ۂ', 'ۃ', 'ۅ', 'ۆ', 'ۈ', 'ۉ', 'ی', 'ێ', 'ے', 'ۓ', '۔', 'ە', 'ۖ', 'ۗ', 'ۙ', 'ۚ', '۞', 'ۡ', 'ۦ', '۩', '۽', 'ۿ', 'ݣ', 'ﭑ', 'ﭼ', 'ﮊ',
    'ﮏ', 'ﮐ', 'ﮔ', 'ﮧ', 'ﮬ', 'ﮭ', 'ﮯ', '﮼', 'ﯙ', 'ﯼ', 'ﯽ', 'ﯾ', '﴾', '﴿', 'ﷲ', 'ﷶ', 'ﷺ', 'ﷻ', '﷼', '﷽', '﹏', 'ﺀ', 'ﺁ', 'ﺂ', 'ﺃ', 'ﺄ', 'ﺆ', 'ﺇ',
    'ﺈ', 'ﺊ', 'ﺋ', 'ﺌ', 'ﺍ', 'ﺎ', 'ﺏ', 'ﺐ', 'ﺑ', 'ﺒ', 'ﺓ', 'ﺔ', 'ﺕ', 'ﺖ', 'ﺗ', 'ﺘ', 'ﺙ', 'ﺚ', 'ﺛ', 'ﺜ', 'ﺝ', 'ﺟ', 'ﺠ', 'ﺡ','ﺣ', 'ﺤ', 'ﺦ', 'ﺧ', 'ﺨ',
    'ﺩ', 'ﺪ', 'ﺫ', 'ﺬ', 'ﺭ', 'ﺮ', 'ﺯ', 'ﺰ', 'ﺱ', 'ﺲ', 'ﺳ', 'ﺴ', 'ﺵ', 'ﺶ', 'ﺷ', 'ﺸ', 'ﺺ', 'ﺻ', 'ﺼ', 'ﺾ', 'ﺿ', 'ﻀ', 'ﻂ', 'ﻃ', 'ﻄ', 'ﻆ', 'ﻇ', 'ﻈ',
    'ﻉ', 'ﻊ', 'ﻋ', 'ﻌ', 'ﻏ', 'ﻐ', 'ﻑ', 'ﻒ', 'ﻓ', 'ﻔ', 'ﻕ', 'ﻖ', 'ﻗ', 'ﻘ', 'ﻙ', 'ﻚ', 'ﻛ', 'ﻜ', 'ﻝ', 'ﻞ', 'ﻟ', 'ﻠ', 'ﻡ', 'ﻢ', 'ﻣ', 'ﻤ', 'ﻥ', 'ﻦ',
    'ﻧ', 'ﻨ', 'ﻩ', 'ﻪ', 'ﻫ', 'ﻬ', 'ﻭ', 'ﻮ', 'ﻯ', 'ﻰ', 'ﻱ', 'ﻲ', 'ﻳ', 'ﻴ', 'ﻶ', 'ﻹ','ﻼ'}